KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_ПропускНаВыезд/КАНАТ_ПропускНаВыезд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_ПропускНаВыезд</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСопроводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТМЦ</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДолжность</name>
    <type>
      <types>EnumRef.КАНАТ_РолиПодписантов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТ_РолиПодписантов/КАНАТ_РолиПодписантов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТ_РолиПодписантов</name>
  <enumValues>
    <name>РуководительЛаборатории</name>
  </enumValues>
  <enumValues>
    <name>РуководительТехОтдела</name>
  </enumValues>
  <enumValues>
    <name>РуководительОУКП</name>
  </enumValues>
  <enumValues>
    <name>СтОператорЭВМ</name>
  </enumValues>
  <enumValues>
    <name>ТехникЛаборант</name>
  </enumValues>
  <enumValues>
    <name>ГенДиректор</name>
  </enumValues>
  <enumValues>
    <name>ВедИнженерТехнолог</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ВсегоСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_ПропускНаВыезд/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|	ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Склад КАК Подразделение,
		|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
		|	РеализацияТоваровУслуг.Партнер КАК Партнер,
		|	ДокументЗаказКлиента.КАНАТ_Водитель КАК Водитель,
		|	ДокументЗаказКлиента.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
		|	ДокументЗаказКлиента.КАНАТ_ГосНомер КАК ГосНомер,
		|	ДокументЗаказКлиента.КАНАТ_АвтомобильМарка КАК Марка,
		|	СправочникНоменклатура.ГруппаФинансовогоУчета КАК ТМЦ,
		|	//КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугТовары.НомерСтроки) КАК КоличествоМест,
		|	ДокументЗаказКлиента.СпособДоставки КАК СпособДоставки,
		|	ДокументЗаказКлиента.КАНАТ_ВодительСсылка КАК ВодительСсылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|				ПО ЗаказКлиентаТовары.Номенклатура = СправочникНоменклатура.Ссылка
		|			ПО ДокументЗаказКлиента.Ссылка = ЗаказКлиентаТовары.Ссылка
		|		ПО РеализацияТоваровУслуг.ЗаказКлиента = ДокументЗаказКлиента.Ссылка
		|		ПРАВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|	И ЗаказКлиентаТовары.НомерСтроки = 1
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Склад,
		|	РеализацияТоваровУслуг.Грузополучатель,
		|	РеализацияТоваровУслуг.Партнер,
		|	ДокументЗаказКлиента.КАНАТ_Водитель,
		|	ДокументЗаказКлиента.КАНАТ_ФИОСопроводителя,
		|	ДокументЗаказКлиента.КАНАТ_ГосНомер,
		|	ДокументЗаказКлиента.КАНАТ_АвтомобильМарка,
		|	СправочникНоменклатура.ГруппаФинансовогоУчета,
		|	ДокументЗаказКлиента.СпособДоставки,
		|	ДокументЗаказКлиента.КАНАТ_ВодительСсылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		ДанныеДокумента = Запрос.Выполнить().Выгрузить();
		
		Если ДанныеДокумента.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокумента[0]);
			
			Если Не ЗначениеЗаполнено(Грузополучатель) Тогда
				Грузополучатель = ДанныеДокумента[0].Партнер;
			КонецЕсли;
			
			Если ДанныеДокумента[0].СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Или
				ДанныеДокумента[0].СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
				
				Водитель = ДанныеДокумента[0].ВодительСсылка;
			КонецЕсли;
		КонецЕсли;
		
		Организация = "КАНАТ";
		ПодписантДолжность = Перечисления.КАНАТ_РолиПодписантов.СтОператорЭВМ;
		ПодписантСотрудник = РегистрыСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения.ПолучитьСотрудникаПоДолжности(ПодписантДолжность);
		
		ДокументОснование = ДанныеЗаполнения;
		
		КоличествоМест = КАНАТ_ВычислитьКоличествоМест(ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры


//БИТ_Гурьев__27.04.24++
Функция КАНАТ_ВычислитьКоличествоМест(Реализация)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаказКлиента = Реализация.ЗаказКлиента;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	ТоварыКОтгрузке.Регистратор КАК Регистратор,
		//|	ТоварыКОтгрузке.КОтгрузке + ТоварыКОтгрузке.Собрано КАК Сумма,
		//|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Серия КАК Серия,
		|	СУММА(Товары.КоличествоУпаковок) КАК Сумма,
		|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК Товары
		|	ПО (ТоварыКОтгрузке.Регистратор = Товары.Ссылка
		|		И ТоварыКОтгрузке.Номенклатура = Товары.Номенклатура 
		|		И ТоварыКОтгрузке.Характеристика = Товары.Характеристика) 
		|ГДЕ
		|	ТоварыКОтгрузке.ДокументОтгрузки = &ДокументОтгрузки
		|	И ТИПЗНАЧЕНИЯ(ТоварыКОтгрузке.Регистратор) = ТИП(Документ.РасходныйОрдерНаТовары)
		|	И Товары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить)
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтгрузке.Регистратор,
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Серия
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыКОтгрузке.Регистратор.Дата,
		|	МИНИМУМ(Товары.НомерСтроки);
		|
		|///////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОтгрузке.Регистратор КАК Регистратор,
		|	СУММА(ТоварыКОтгрузке.КОформлению) КАК Сумма,
		|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузке.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
		|ГДЕ
		|	ТоварыКОтгрузке.ДокументОтгрузки = &ДокументОтгрузки
		|	И ТИПЗНАЧЕНИЯ(ТоварыКОтгрузке.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг)
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтгрузке.Регистратор,
		|	ТоварыКОтгрузке.Номенклатура,
		|	ТоварыКОтгрузке.Характеристика
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыКОтгрузке.Регистратор.Дата";
	
	Запрос.УстановитьПараметр("ДокументОтгрузки", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыгрузкаРасходныйОрдер = РезультатЗапроса[0].Выгрузить();
	ВыгрузкаРеализация = РезультатЗапроса[1].Выгрузить();
	
	СоответствиеРеализацияМеста = Новый Соответствие;
	
	Для Каждого РеализацияСтрока Из ВыгрузкаРеализация Цикл
		
		Для Каждого РОСтрока Из ВыгрузкаРасходныйОрдер Цикл
			
			Если РеализацияСтрока.Сумма = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если РОСтрока.Номенклатура <> РеализацияСтрока.Номенклатура 
				ИЛИ РОСтрока.Характеристика <> РеализацияСтрока.Характеристика 
				ИЛИ РОСтрока.Сумма = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СоответствиеРеализацияМеста[РеализацияСтрока.Регистратор]) Тогда
				СоответствиеРеализацияМеста[РеализацияСтрока.Регистратор] = 1;
			Иначе
				СоответствиеРеализацияМеста[РеализацияСтрока.Регистратор] = СоответствиеРеализацияМеста[РеализацияСтрока.Регистратор] + 1;
			КонецЕсли;
			
			Если РеализацияСтрока.Сумма > РОСтрока.Сумма Тогда
				
				РеализацияСтрока.Сумма = РеализацияСтрока.Сумма - РОСтрока.Сумма;
				РОСтрока.Сумма = 0;
				
			Иначе
				
				РОСтрока.Сумма = 0;
				РеализацияСтрока.Сумма = 0;
				
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЦикла;
	
	Результат = СоответствиеРеализацияМеста[Реализация];
	
	//Для Каждого СтрокаРО Из СоответствиеРеализацияРО[Реализация] Цикл
	//	
	//	Результат = Результат + СтрокаРО.РасходныйОрдер.КАНАТ_ВсегоСерий;
	//	
	//КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции //БИТ_Гурьев__27.04.24--
